For Pandas assignments, you are going to use [Titanic](https://www.kaggle.com/c/titanic/download/GQf0y8ebHO0C4JXscPPp%2Fversions%2FXkNkvXwqPPVG0Qt3MtQT%2Ffiles%2Ftrain.csv) (train.csv) dataset. Download the dataset and load to a data frame.

**(1)** Calculate the average age of the passengers for each gender and passenger class by using `groupby()` method.

In [41]:
import numpy as np 
import pandas as pd
train=pd.read_csv('train.csv')

In [42]:
train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [43]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [44]:
mean_age_sp=train.groupby(["Sex", "Pclass"]).mean().Age
mean_age_sp

Sex     Pclass
female  1         34.611765
        2         28.722973
        3         21.750000
male    1         41.281386
        2         30.740707
        3         26.507589
Name: Age, dtype: float64

**(2)** Group by embarkation port and print values. (Notice that you get unique values with this.)

In [45]:
for i in train.columns[0:11]:
  print(train.groupby(by="Embarked").count()[i])

Embarked
C    168
Q     77
S    644
Name: PassengerId, dtype: int64
Embarked
C    168
Q     77
S    644
Name: Survived, dtype: int64
Embarked
C    168
Q     77
S    644
Name: Pclass, dtype: int64
Embarked
C    168
Q     77
S    644
Name: Name, dtype: int64
Embarked
C    168
Q     77
S    644
Name: Sex, dtype: int64
Embarked
C    130
Q     28
S    554
Name: Age, dtype: int64
Embarked
C    168
Q     77
S    644
Name: SibSp, dtype: int64
Embarked
C    168
Q     77
S    644
Name: Parch, dtype: int64
Embarked
C    168
Q     77
S    644
Name: Ticket, dtype: int64
Embarked
C    168
Q     77
S    644
Name: Fare, dtype: int64
Embarked
C     69
Q      4
S    129
Name: Cabin, dtype: int64